src/Catalogs/цур_Роли/цур_Роли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>цур_Роли</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.цур_ИнформационныеБазы</owners>
  <attributes>
    <name>ИмяРолиВКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьДляНовыхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьДляРеквизитовПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимыеПраваПодчиненных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.цур_СтатусыРоли</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСоставаРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/цур_XMLРолейКонфигурации/цур_XMLРолейКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_XMLРолейКонфигурации</name>
  <resources>
    <name>XMLТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.цур_ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/цур_Роли/Forms/ФормаВыбораРоли/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьРолиКонфигурации();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРолиКонфигурации

&НаКлиенте
Процедура РолиКонфигурацииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.РолиКонфигурации.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Закрыть(ТекущиеДанные.Значение);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРолиКонфигурации()

	Если ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		ЗаполнитьРолиКонфигурацииПоИнформационнойБазе();
	Иначе
		ЗаполнитьВсеРолиКонфигурации();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеРолиКонфигурации()

	Для Каждого ТекущаяРоль Из Метаданные.Роли Цикл

		Представление = ?(ПустаяСтрока(ТекущаяРоль.Синоним),
			ТекущаяРоль.Имя,
			СтрШаблон("%1 (%2)", ТекущаяРоль.Синоним, ТекущаяРоль.Имя));

		РолиКонфигурации.Добавить(ТекущаяРоль.Имя, Представление);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРолиКонфигурацииПоИнформационнойБазе()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РС.ИмяРоли КАК ИмяРоли
	|ИЗ
	|	РегистрСведений.цур_XMLРолейКонфигурации КАК РС
	|ГДЕ
	|	РС.ИнформационнаяБаза = &ИнформационнаяБаза
	|УПОРЯДОЧИТЬ ПО
	|	РС.ИмяРоли";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		ИмяРоли     = Выборка.ИмяРоли;
		РольМД      = Метаданные.Роли.Найти(ИмяРоли);
		Представление = ИмяРоли;

		Если РольМД <> Неопределено И НЕ ПустаяСтрока(РольМД.Синоним) Тогда
			Представление = СтрШаблон("%1 (%2)", РольМД.Синоним, ИмяРоли);
		КонецЕсли;

		РолиКонфигурации.Добавить(ИмяРоли, Представление);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
